tutorials/multiphase/compressibleInterFoam/les/depthCharge3D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 1
    volScalarFieldValue p 1e5
);

regions
(
    sphereToCell
    {
        centre (0.5 0.5 0.5);
        radius 0.1;

        fieldValues
        (
            volScalarFieldValue alpha1 0
            volScalarFieldValue p 10e5
        );
    }

    boxToCell
    {
        box (-10 1 -1) (10 10 1);

        fieldValues
        (
            volScalarFieldValue alpha1 0
        );
    }
);

// ************************************************************************* //
